# Customer API - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-umBXdhGnxKUQGHnS

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-customer-api-staging-customer-api]
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=6efdf24jn7]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230423052105664100000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=edfc614b91aa2a91f66b53a85a54315efb08e245]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=spdcay8]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=xftcak4]
module.aws_api_gateway.aws_apigatewayv2_api.default: Drift detected (delete)
module.aws_api_gateway.aws_apigatewayv2_integration.default: Drift detected (delete)
module.aws_api_gateway.aws_apigatewayv2_route.any: Drift detected (delete)
module.aws_api_gateway.aws_apigatewayv2_stage.default: Drift detected (delete)
module.aws_api_gateway.aws_cloudwatch_log_group.default: Drift detected (delete)
module.aws_api_gateway.aws_lambda_permission.default: Drift detected (delete)
module.aws_lambda.aws_cloudwatch_log_group.default: Drift detected (delete)
module.aws_lambda.aws_iam_role.default: Drift detected (update)
module.aws_lambda.aws_lambda_function.default: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aws_api_gateway.aws_apigatewayv2_api.default has been deleted
  - resource "aws_apigatewayv2_api" "default" {
      - api_endpoint                 = "https://6efdf24jn7.execute-api.ap-southeast-2.amazonaws.com" -> null
      - execution_arn                = "arn:aws:execute-api:ap-southeast-2:514472330244:6efdf24jn7" -> null
      - id                           = "6efdf24jn7" -> null
      - name                         = "api-gateway-customer-api-staging-customer-api" -> null
        tags                         = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default has been deleted
  - resource "aws_apigatewayv2_integration" "default" {
      - id                     = "spdcay8" -> null
        # (9 unchanged attributes hidden)
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default has been deleted
  - resource "aws_cloudwatch_log_group" "default" {
      - arn               = "arn:aws:logs:ap-southeast-2:514472330244:log-group:/aws/api_gateway/api-gateway-customer-api-staging-customer-api" -> null
        id                = "/aws/api_gateway/api-gateway-customer-api-staging-customer-api"
        name              = "/aws/api_gateway/api-gateway-customer-api-staging-customer-api"
        tags              = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (3 unchanged attributes hidden)
    }

  # module.aws_lambda.aws_lambda_function.default has been deleted
  - resource "aws_lambda_function" "default" {
      - function_name                  = "lambda-customer-api-staging-customer-api" -> null
        id                             = "lambda-customer-api-staging-customer-api"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:lambda-customer-api-staging-customer-api/invocations" -> null
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "api-gateway-customer-api-staging-customer-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all                     = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_route.any will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/api-gateway-customer-api-staging-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-customer-api-staging-customer-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/lambda-customer-api-staging-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
    }

  # module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../../../../shared/infrastructure/modules/aws/lambda/lambda.zip"
      + function_name                  = "lambda-customer-api-staging-customer-api"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-customer-api-staging"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "BZXwJRdKzrdLUL+ctMV0G0ZCuecQRa0Q38EOd9QY5mo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*